loadtest/results/20260922-123858/4-step-500rps.txt
Running 30s test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 94.338ms, rate sampling interval: 198ms
  Thread calibration: mean lat.: 97.717ms, rate sampling interval: 207ms
  Thread calibration: mean lat.: 97.865ms, rate sampling interval: 211ms
  Thread calibration: mean lat.: 94.674ms, rate sampling interval: 196ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   117.25ms   51.16ms 388.10ms   87.68%
    Req/Sec   125.03     89.59   252.00     51.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   97.22ms
 75.000%  124.48ms
 90.000%  182.40ms
 99.000%  331.26ms
 99.900%  383.74ms
 99.990%  385.02ms
 99.999%  388.35ms
100.000%  388.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      72.127     0.000000            1         1.00
      82.495     0.100000          999         1.11
      85.311     0.200000         1993         1.25
      87.935     0.300000         2989         1.43
      91.711     0.400000         3979         1.67
      97.215     0.500000         4971         2.00
     100.223     0.550000         5466         2.22
     104.639     0.600000         5956         2.50
     109.759     0.650000         6452         2.86
     116.607     0.700000         6949         3.33
     124.479     0.750000         7445         4.00
     129.535     0.775000         7693         4.44
     133.631     0.800000         7951         5.00
     140.287     0.825000         8190         5.71
     153.471     0.850000         8438         6.67
     167.551     0.875000         8686         8.00
     175.359     0.887500         8810         8.89
     182.527     0.900000         8936        10.00
     191.871     0.912500         9059        11.43
     209.919     0.925000         9183        13.33
     221.567     0.937500         9306        16.00
     230.143     0.943750         9368        17.78
     232.575     0.950000         9431        20.00
     239.615     0.956250         9492        22.86
     254.207     0.962500         9554        26.67
     261.119     0.968750         9616        32.00
     270.079     0.971875         9647        35.56
     285.951     0.975000         9678        40.00
     299.263     0.978125         9712        45.71
     300.287     0.981250         9750        53.33
     301.311     0.984375         9771        64.00
     302.591     0.985938         9787        71.11
     307.455     0.987500         9802        80.00
     319.999     0.989062         9818        91.43
     333.567     0.990625         9833       106.67
     337.663     0.992188         9849       128.00
     338.431     0.992969         9857       142.22
     339.711     0.993750         9867       160.00
     340.223     0.994531         9872       182.86
     341.247     0.995313         9880       213.33
     344.575     0.996094         9889       256.00
     348.671     0.996484         9893       284.44
     351.231     0.996875         9895       320.00
     355.839     0.997266         9899       365.71
     360.447     0.997656         9903       426.67
     369.151     0.998047         9907       512.00
     370.943     0.998242         9909       568.89
     376.063     0.998437         9911       640.00
     379.903     0.998633         9913       731.43
     383.487     0.998828         9915       853.33
     383.743     0.999023         9919      1024.00
     383.743     0.999121         9919      1137.78
     383.743     0.999219         9919      1280.00
     383.999     0.999316         9921      1462.86
     383.999     0.999414         9921      1706.67
     384.255     0.999512         9923      2048.00
     384.255     0.999561         9923      2275.56
     384.255     0.999609         9923      2560.00
     384.255     0.999658         9923      2925.71
     384.511     0.999707         9924      3413.33
     384.511     0.999756         9924      4096.00
     384.511     0.999780         9924      4551.11
     385.023     0.999805         9925      5120.00
     385.023     0.999829         9925      5851.43
     385.023     0.999854         9925      6826.67
     385.023     0.999878         9925      8192.00
     385.023     0.999890         9925      9102.22
     388.351     0.999902         9926     10240.00
     388.351     1.000000         9926          inf
#[Mean    =      117.253, StdDeviation   =       51.163]
#[Max     =      388.096, Total count    =         9926]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14796 requests in 30.26s, 5.04MB read
  Non-2xx or 3xx responses: 1386
Requests/sec:    488.91
Transfer/sec:    170.68KB
------------------------------
X-Cache  HIT=12825  MISS=585  BYPASS=0  writes=0  http_errors=1386
Cache hit ratio: 95.64%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       97.22 ms
p90      182.40 ms
p99      331.26 ms
p99.9    383.74 ms