loadtest/results/20260922-123858/4-step-750rps.txt
Running 30s test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 147.521ms, rate sampling interval: 598ms
  Thread calibration: mean lat.: 142.761ms, rate sampling interval: 538ms
  Thread calibration: mean lat.: 143.814ms, rate sampling interval: 548ms
  Thread calibration: mean lat.: 143.823ms, rate sampling interval: 545ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   243.25ms  166.17ms   1.46s    85.98%
    Req/Sec   183.61     48.06   278.00     75.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  184.57ms
 75.000%  306.69ms
 90.000%  480.25ms
 99.000%  825.34ms
 99.900%  974.34ms
 99.990%    1.30s 
 99.999%    1.46s 
100.000%    1.46s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      75.839     0.000000            1         1.00
      96.767     0.100000         1455         1.11
     114.111     0.200000         2914         1.25
     134.911     0.300000         4365         1.43
     157.823     0.400000         5825         1.67
     184.575     0.500000         7273         2.00
     202.495     0.550000         8001         2.22
     224.127     0.600000         8727         2.50
     249.343     0.650000         9456         2.86
     277.247     0.700000        10188         3.33
     306.687     0.750000        10908         4.00
     324.351     0.775000        11273         4.44
     348.671     0.800000        11636         5.00
     370.943     0.825000        11999         5.71
     397.823     0.850000        12365         6.67
     430.591     0.875000        12726         8.00
     456.191     0.887500        12907         8.89
     480.255     0.900000        13089        10.00
     501.759     0.912500        13271        11.43
     525.823     0.925000        13455        13.33
     559.615     0.937500        13641        16.00
     579.071     0.943750        13728        17.78
     598.015     0.950000        13816        20.00
     619.007     0.956250        13909        22.86
     646.655     0.962500        13998        26.67
     681.983     0.968750        14089        32.00
     697.855     0.971875        14134        35.56
     712.703     0.975000        14181        40.00
     728.575     0.978125        14226        45.71
     747.519     0.981250        14271        53.33
     769.535     0.984375        14316        64.00
     785.407     0.985938        14339        71.11
     798.207     0.987500        14363        80.00
     814.079     0.989062        14384        91.43
     831.487     0.990625        14407       106.67
     860.671     0.992188        14430       128.00
     867.839     0.992969        14441       142.22
     882.175     0.993750        14453       160.00
     904.191     0.994531        14464       182.86
     914.431     0.995313        14475       213.33
     923.135     0.996094        14488       256.00
     928.767     0.996484        14492       284.44
     938.495     0.996875        14498       320.00
     948.735     0.997266        14506       365.71
     950.271     0.997656        14509       426.67
     957.951     0.998047        14515       512.00
     964.095     0.998242        14519       568.89
     966.143     0.998437        14521       640.00
     969.215     0.998633        14524       731.43
     973.311     0.998828        14526       853.33
     975.871     0.999023        14529      1024.00
     978.943     0.999121        14532      1137.78
     978.943     0.999219        14532      1280.00
     993.791     0.999316        14534      1462.86
    1005.055     0.999414        14535      1706.67
    1020.415     0.999512        14536      2048.00
    1025.535     0.999561        14537      2275.56
    1119.231     0.999609        14538      2560.00
    1203.199     0.999658        14539      2925.71
    1203.199     0.999707        14539      3413.33
    1211.391     0.999756        14540      4096.00
    1211.391     0.999780        14540      4551.11
    1220.607     0.999805        14541      5120.00
    1220.607     0.999829        14541      5851.43
    1220.607     0.999854        14541      6826.67
    1296.383     0.999878        14542      8192.00
    1296.383     0.999890        14542      9102.22
    1296.383     0.999902        14542     10240.00
    1296.383     0.999915        14542     11702.86
    1296.383     0.999927        14542     13653.33
    1463.295     0.999939        14543     16384.00
    1463.295     1.000000        14543          inf
#[Mean    =      243.247, StdDeviation   =      166.170]
#[Max     =     1462.272, Total count    =        14543]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  22156 requests in 30.26s, 7.55MB read
  Non-2xx or 3xx responses: 2184
Requests/sec:    732.20
Transfer/sec:    255.35KB
------------------------------
X-Cache  HIT=19298  MISS=674  BYPASS=0  writes=0  http_errors=2184
Cache hit ratio: 96.63%
Socket errors: connect=0 read=0 write=0 timeout=0
p50      184.57 ms
p90      480.25 ms
p99      825.34 ms
p99.9    974.34 ms